examples/openfoam_periodichills/periodichills_template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         13000;

deltaT          1;

writeControl    runTime;

writeInterval   13000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      fixed;

timePrecision   0;

runTimeModifiable true;


functions
{
    //#include "derivedFields"
    //#include "sampling"
    // #include "samplingDebug"
    yPlus1
    {
    type        yPlus;
    libs        ("libfieldFunctionObjects.so");
    writeControl timeStep;
    writeInterval $writeInterval;
    }

}

// ************************************************************************* //
